public class Main {
   public static void main(String[] args) {
      /*
     1. Вопрос
      Абстракные, анонимные, вложенные, финализированные, статические

     2. Вопрос
      В интрфейсе могут распологаться объявления методов, без реализации, переменные
      В абстрактны классах могут распологаться перменные, абстрактные методы, обычные методы, переменные

     3. Вопрос
      Существует 4 вида модификатора доступа - public, private, protected,
      и модификатор "по умолчанию" или package private
      public - виден ото всюду, во всех классах и пакетах, можно обращаться из любого места программы. Самый открытый
      private - можно обратиться только из класса, где он объявлен. Самый закрытый модификатор
      protected - доступен для всего пакета в котором находится класс + для классов-наследников
      package private - доступен для всего пакета, где распположен класс

     4. Вопрос
      Нет, невозможно.

       */
   }
}