public class Task1 {
    public static void main(String[] args) {
/*
       1. Вопрос
        Данные типы отличаются тем, что предназначены для разного вида данных
        1. byte, short, int, long - для работы с целыми числами
        2. float, double - для работы со значениями с плавающей точкой (дробные)
        3. char - для работы с символами
        4. boolean - для работы с логическими переменными (true\false) то есть можно работать как с флагом
        5. Также есть ссылочные типы данных - один из самых популярных на равне с примитивами String.
        Есть ссылочные типы данных, которые расположены в стандартных библиотеках, есть классы, которые мы можем создать сами.

       2. Вопрос
        Например - StringBuffer, StringBuilder, BigDecimal, BigInteger
 */
    }
}
